
       01 WS-BALANCE-REC.
           05 WS-OPERATION   PIC X(6).
           05 WS-AMOUNT      PIC 9(6)V99.
           05 WS-TEST-FLAG   PIC X.
           05 WS-VALUE       PIC 9(6)V99.
