
       01 LS-BALANCE-REC.
           05 LS-OPERATION   PIC X(6).
           05 LS-AMOUNT      PIC 9(6)V99.
           05 LS-TEST-FLAG   PIC X.
           05 LS-VALUE       PIC 9(6)V99.
