       IDENTIFICATION DIVISION.
       PROGRAM-ID. DataProgram.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  STORAGE-BALANCE    PIC 9(6)V99 VALUE 1000.00.
       01  INITIALIZED        PIC X VALUE 'N'.
           88 IS-INITIALIZED VALUE 'Y'.

       LINKAGE SECTION.
       COPY balancels.

       PROCEDURE DIVISION USING LS-BALANCE-REC.
           IF NOT IS-INITIALIZED
               MOVE 1000.00 TO STORAGE-BALANCE
               SET IS-INITIALIZED TO TRUE
           END-IF

           IF LS-OPERATION = 'READ'
               MOVE STORAGE-BALANCE TO LS-VALUE
           ELSE IF LS-OPERATION = 'WRITE'
               MOVE LS-VALUE TO STORAGE-BALANCE
               MOVE STORAGE-BALANCE TO LS-VALUE
           END-IF
           GOBACK.
